target/classes/CarRentalService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://e-booking.com/schema/rental" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="CarRentalService" targetNamespace="http://e-booking.com/schema/rental">
  <wsdl:types>
    <xsd:schema targetNamespace="http://e-booking.com/schema/rental">
		<xsd:import namespace="http://e-booking.com/schema/rental" schemaLocation="CarRentalSchema.xsd"/>
    </xsd:schema>
  </wsdl:types>
  
  <wsdl:message name="ReserveRequest">
    <wsdl:part name="reserveRequest" type="ReserveRequestType"/>
  </wsdl:message>
  <wsdl:message name="ReserveResponse">
    <wsdl:part name="reserveResponse" type="ReserveResponseType"/>
  </wsdl:message>
  <wsdl:message name="CancelRequest">
    <wsdl:part name="cancelRequest" type="CancelRequestType"/>
  </wsdl:message>
  <wsdl:message name="CancelResponse">
    <wsdl:part name="cancelResponse" type="CanselResponseType"/>
  </wsdl:message>
  <wsdl:message name="ListReservationsRequest">
    <wsdl:part name="listReservationsRequest" type="ListReservationsRequestType"/>
  </wsdl:message>
  <wsdl:message name="ListReservationsResponse">
    <wsdl:part name="listReservationsResponse" type="ListReservationsResponseType"/>
  </wsdl:message>
  
  <wsdl:portType name="CarRentalServicePortType">
    <wsdl:operation name="Reservation">
      <wsdl:input message="tns:ReserveRequest" name="ReserveRequest"/>
      <wsdl:output message="tns:ReserveResponse" name="ReserveResponse"/>
    </wsdl:operation>
    
     <wsdl:operation name="CancelReservation">
      <wsdl:input message="tns:CancelRequest" name="CancelRequest"/>
      <wsdl:output message="tns:CancelResponse" name="CancelResponse"/>
    </wsdl:operation>
    
    <wsdl:operation name="ListReservation">
      <wsdl:input message="tns:ListReservationsRequest" name="ListReservationsRequest"/>
      <wsdl:output message="tns:ListReservationsResponse" name="ListReservationsResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  
  
  <wsdl:binding name="CarRentalServiceSOAP" type="tns:CarRentalService">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="ListReservation">
      <soap:operation soapAction="http://e-booking.com/schema/rental/ListReservation"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  
  <wsdl:service name="CarRentalService">
    <wsdl:port binding="tns:CarRentalServiceSOAP" name="CarRentalServiceSOAP">
      <soap:address location="http://e-booking.com"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
