list.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://e-booking.com/schema/rental">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:ListReservation>
        </gs:ListReservation>
    </soapenv:Body>
</soapenv:Envelope>